title: Potential LSASS Memory Dump
id: detection-2
tldr: Detects process access LSASS memory with GrantedAccess that is typical for dumping tools

logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: '\lsass.exe'
        GrantedAccess:
            - '0x40'
            - '0x1000'
            - '0x1400'
            - '0x100000'
            - '0x1410'  
            - '0x1010'  
            - '0x1438' 
            - '0x143a' 
            - '0x1418' 
            - '0x1f0fff'
            - '0x1f1fff'
            - '0x1f2fff'
            - '0x1f3fff'
    condition: selection
level: low
